ads/radixsort.html
---
layout: page
title: Radixsort
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Radixsort</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Idee:</b> Sortiere \(n\) natürliche Zahlen, die aus jeweils \(d\) Ziffern
bestehen (vgl. B-adische Zahlendarstellung) und jede Ziffer einen Wert
aus \(\{0,...,k-1\}\) hat mit Hilfe von <i>Bucketsort</i>. Die
Ziffernpositionen seien von rechts nach links durchnummeriert mit 1 bis
</p>
<ol class="org-ol">
<li></li>
</ol>

<pre class="example">
RADIXSORT(A, d, k) {
  integer l = length(A);
  for l = 1 to d do
    sortiere die n Zahlen in A gemäß Ziffer l mit Bucketsort und k Buckets;
  od
}
</pre>

<p>
<b>Laufzeit:</b> \(\mathcal{O}(d(n+k))\)
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Eigenschaften</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>nach \(l\) Iterationen sind dann die \(n\) Zahlen gemäß der letzten \(l\)
   Ziffern sortiert
</li>
</ul>
</div>
</div>
</div>
